[
    {
        "name": "MERN Stack App",
        "techStack": [
            "MongoDB",
            "Express.js",
            "React.js",
            "Node.js",
            "GraphQL",
            "SQL",
            "TypeScript/JavaScript",
            "SCSS/CSS",
            "HTML5",
            "Git",
            "BitBucket",
            "JIRA"
        ],
        "length": "1 year, 2 months",
        "summary": "A web app platform and API for a large automotive OEM intended to centralize common digital work operations and reduce cost of new, web-ready applications.",
        "knowledgeGained": [
            "How to proficiently write and read TypeScript/JavaScript.",
            "How to utilize the MERN Stack (MongoDB, Express.js, React.js, Node.js) to develop professional-grade Web Apps.",
            "How to utilize GraphQL to facilitate communication between a client and a server.",
            "How to proficiently create SCSS/CSS styles to beautify a Web App.",
            "How to proficiently discuss software development tasks with clients based in another country (English Second Language)."
        ],
        "achievements": [
            "Ability to quickly pick up and competently utilize the technology stack for the project was commended by team lead.",
            "Played an active role in design decisions: researched, reviewed, and wrote detailed reports regarding potential techniques and technologies to accomplish feature goals.",
            "Took on leadership responsibilities: provided strong communication with the client, delegated and accepted tasks according to team strengths, and trained team members on relevant technologies."
        ],
        "achievements_archived": [
            "Performed as acting lead developer: communicated directly with customer regarding estimations, issues, and new feature or bug requests; organized and delegated tasks according to team strengths and abilities; trained team members on relevant technologies as the need arose.",
            "Commended by team lead for ability to quickly pick up the necessary skills to competently and confidently complete development tasks related to the project (little prior JavaScript/TypeScript experience)."
        ]
    }
]